app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "A product"], ["price", "1.0"], ["created_at", "2024-11-21 15:15:20.266907"], ["updated_at", "2024-11-21 15:15:20.266907"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", "Another name"], ["price", "2.0"], ["updated_at", "2024-11-21 15:15:20.275453"], ["id", 5]]

  def destroy
    @product.destroy!
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 8]]